{"dID":95708,"playerDiags":5,"actionNodes":0,"startPoint":0,"loadTag":"","previewPanning":false,"autosave":true,"locEdit":false,"showSettings":true,"pd_isp_0":false,"pd_rect_0":[-160,180],"pd_comSize_0":1,"pd_ID_0":0,"pd_pTag_0":"","pd_sprite_0":"","pd_expand_0":false,"pd_vars0":0,"pd_0_com_0iSet":-1,"pd_0_com_0oAns":1,"pd_0_com_0oAct":-1,"pd_0_com_0text":"Placeholder\n\nThe local newspaper fades into view. It has a review for the play on it, with a rating to show how well the player did. It stays on screen until the player clicks, at which point it fades to black. Credits could be played here. We could have buttons that say Quit or Play again or we could just quit the game for them, whatever’s easier to code.\n\nNote, it may be better to impose a newspaper clipping","pd_0_com_0extraD":"ExtraData","pd_0_com_0showmore":false,"pd_0_com_0visible":true,"pd_0_com_0audio":"","pd_0_com_0sprite":"","pd_isp_1":true,"pd_rect_1":[340,130],"pd_comSize_1":3,"pd_ID_1":1,"pd_pTag_1":"","pd_sprite_1":"","pd_expand_1":false,"pd_vars1":0,"pd_1_com_0iSet":-1,"pd_1_com_0oAns":2,"pd_1_com_0oAct":-1,"pd_1_com_0text":"Good Ending","pd_1_com_0extraD":"ExtraData","pd_1_com_0showmore":false,"pd_1_com_0visible":true,"pd_1_com_0audio":"","pd_1_com_0sprite":"","pd_1_com_1iSet":1,"pd_1_com_1oAns":3,"pd_1_com_1oAct":-1,"pd_1_com_1text":"Neutral Ending\t","pd_1_com_1extraD":"ExtraData","pd_1_com_1showmore":false,"pd_1_com_1visible":true,"pd_1_com_1audio":"","pd_1_com_1sprite":"","pd_1_com_2iSet":1,"pd_1_com_2oAns":4,"pd_1_com_2oAct":-1,"pd_1_com_2text":"Bad Ending","pd_1_com_2extraD":"ExtraData","pd_1_com_2showmore":false,"pd_1_com_2visible":true,"pd_1_com_2audio":"","pd_1_com_2sprite":"","pd_isp_2":false,"pd_rect_2":[800,-210],"pd_comSize_2":1,"pd_ID_2":2,"pd_pTag_2":"","pd_sprite_2":"","pd_expand_2":false,"pd_vars2":0,"pd_2_com_0iSet":-1,"pd_2_com_0oAns":-1,"pd_2_com_0oAct":-1,"pd_2_com_0text":"5 STARS\n\nClassic play breathes new life into old Avalon Community Theatre! In a stunning performance, the Avalon Community Theatre’s rendition of A Christmas Carol has brought new life to what many had written off as an old box of memories. Since burning down in the 1950s, Avalon Community Theatre has not had a director and cast so dedicated, nor a performance so successful. Thomas Bristol, the theatre’s current owner and the actor playing Ebenezer Scrooge commented that such a successful performance wouldn’t have been possible without their director. We’ve also learned that McKenzie Alondra - the play’s Mrs. Cratchit - has been approached by numerous Broadway talent agencies. Daniel Rossi, perhaps better known as Mr. Bob Cratchit, has been accepted to Northwestern University’s performing arts program for his performance. Samantha Hooper, her uncle Thomas reports, is simply excited to star in her elementary school’s theatre production of Goldilocks and the Three Bears later this year. We at The Avalon are happy to report that with the success of A Christmas Carol, it seems the director has managed to put Avalon Community Theatre back on the map, making it a destination location for all those serious about the performing arts.","pd_2_com_0extraD":"ExtraData","pd_2_com_0showmore":false,"pd_2_com_0visible":true,"pd_2_com_0audio":"","pd_2_com_0sprite":"","pd_isp_3":false,"pd_rect_3":[1170,-210],"pd_comSize_3":1,"pd_ID_3":3,"pd_pTag_3":"","pd_sprite_3":"","pd_expand_3":false,"pd_vars3":0,"pd_3_com_0iSet":-1,"pd_3_com_0oAns":-1,"pd_3_com_0oAct":-1,"pd_3_com_0text":"3 STARS\n\nHumdrum performance at Avalon Community Theatre falls on deaf ears. In a mundane performance, the Avalon Community Theatre’s rendition of A Christmas Carol failed to excite, though many families still claimed to have enjoyed their experience attending. Since burning down in the 1950s, Avalon Community Theatre has not had a successful performance, and this director’s small-cast A Christmas Carol encountered lukewarm reception. Thomas Bristol, the theatre’s current owner and the actor playing Ebenezer Scrooge, commented that the performance would likely have done better if the director had put in more effort with the entire cast. We’ve also learned that McKenzie Alondra - the play’s Mrs. Cratchit - continues to audition for any part that comes her way, hoping for her big break. Daniel Rossi, perhaps better known as Mr. Bob Cratchit, refused to comment on his plans for the future, except to vehemently point out they wouldn’t involve acting. Samantha Hooper, her uncle Thomas reports, is simply excited to be one of the bears in her elementary school’s theatre production of Goldilocks and the Three Bears later this year. We at The Avalon are say to say that it doesn’t look like this director was able to put Avalon Community Theatre back on the map as a destination for those interested in the performing arts, but the theatre continues to struggle onward in hopes the next production will be better than the last.","pd_3_com_0extraD":"ExtraData","pd_3_com_0showmore":false,"pd_3_com_0visible":true,"pd_3_com_0audio":"","pd_3_com_0sprite":"","pd_isp_4":false,"pd_rect_4":[1580,-210],"pd_comSize_4":1,"pd_ID_4":4,"pd_pTag_4":"","pd_sprite_4":"","pd_expand_4":false,"pd_vars4":0,"pd_4_com_0iSet":-1,"pd_4_com_0oAns":-1,"pd_4_com_0oAct":-1,"pd_4_com_0text":"1 STAR\n\nOverdone play sends Avalon Community Theatre further into the past. In a lackluster performance, the Avalon Community Theatre’s rendition of A Christmas Carol has proven that some relics should remain in the past. Since burning down in the 1950s, Avalon Community Theatre has not had a successful production, and this performance continued to disappoint. Thomas Bristol, the theatre’s current owner and a washed-up actor trying to reclaim his glory in the role of Ebenezer Scrooge, angrily commented that such a dreadful performance was the fault of poor direction. We’ve also learned that McKenzie Alondra - the play’s Mrs. Cratchit - has been rejected by numerous talent agencies, and mentioned in tears that she may as well give up acting forever. Daniel Rossi, perhaps better known as Mr. Bob Cratchit, has not been seen since his debut and has been reported missing by the boy’s family. Samantha Hooper, her uncle Thomas reports, has forgone acting in favor of softball practice. We at The Avalon are sorry to say that with this disastrous performance, the Avalon Community Theatre has declared bankruptcy. It seems the next time families wish to spend a day at the theatre in this town, they’ll have to see a movie.\r","pd_4_com_0extraD":"ExtraData","pd_4_com_0showmore":false,"pd_4_com_0visible":true,"pd_4_com_0audio":"","pd_4_com_0sprite":""}